app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
  def show
    @profile = Profile.find(params[:id])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
  def edit
    @profile = Profile.find(params[:id])

INSERT INTO `profiles` (`about_me`, `created_at`, `references`, `updated_at`, `user_id`, `user_name`, `user_type`) VALUES ('I like to strike a pose on the catwalk', '2012-07-20 03:45:08', 'Many photographers', '2012-07-20 03:45:08', NULL, 'Kate Moss', 'Model')
---
  def create
    @profile = Profile.new(params[:profile])

    respond_to do |format|
      if @profile.save

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
UPDATE `profiles` SET `about_me` = 'memememememekhvkhv', `updated_at` = '2012-07-30 05:39:25' WHERE `profiles`.`id` = 1
---
  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
DELETE FROM `profiles` WHERE `profiles`.`id` = 1
---
  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy